app/Http/Controllers/NotesController.php

select * from `notes` limit 3 offset 0
select count(*) as aggregate from `notes`
select * from `notes`
---
    public function index()
    {
        $notes = Note::query()->paginate(3);
        return view('note.index')->with('nodes', $nodes);