app/Http/Controllers/Admin/NewsController.php

select * from `news`
---
    public function index() {

        $news = News::all();

insert into `news` (`image`, `title`, `text`, `updated_at`, `created_at`) values ('/storage/hQZdLZCz4UV6uf7Fr0BOLYPVnbP7PpwnPPXgKIhL.jpeg', '234', '234', '2020-10-07 17:17:44', '2020-10-07 17:17:44')
---
    public function store(Request $request) {

        $url = null;
        // dd($request->image);
        if ($request->file('image')) {
            $path = Storage::putFile('public', $request->file('image'));
            $url = Storage::url($path);

        }

        $this->validate($request, News::rules(), [], News::attributeNames());



        //TODO сделать обработку isPrivate
        $news = new News();
        $news->image = $url;

        $news->fill($request->except('image'))->save();

select * from `categories`
---
    public function edit(News $news) {
        return view('admin.create', [
            'news' => $news,
            'categories' => Category::all()
        ]);